# -*- org-export-babel-evaluate: nil -*-
# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+AUTHOR: Otho José Sirtoli Marcondes, Philippe O. A. Navaux, Lucas Mello Schnorr
#+EMAIL: ojsmarcondes@inf.ufrgs.br, navaux@inf.ufrgs.br, schnorr@inf.ufrgs.br
#+DATE: September 2025
#+STARTUP: overview indent
#+LANGUAGE: pt-br
#+OPTIONS: H:3 creator:nil timestamp:nil skip:nil toc:nil num:t ^:nil ~:~
#+OPTIONS: author:nil title:nil date:nil
#+TAGS: noexport(n) deprecated(d) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+BIBLIOGRAPHY: ./refs.bib

#+LATEX_CLASS: IEEEtran
#+LATEX_CLASS_OPTIONS: [conference, 10pt, final]
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{booktabs}

*** Read

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
options(crayon.enabled=FALSE)
library(tidyverse)
bind_rows(
  read_delim("data/block-size.csv", show_col_types=FALSE, progress=FALSE, delim=";"),
  read_delim("data/block-def.csv", show_col_types=FALSE, progress=FALSE, delim=";")
) -> df
df
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 110 × 16
      Id Function     threads  gpus     P     Q mtxfmt    nb     m     n   lda
   <dbl> <chr>          <dbl> <dbl> <dbl> <dbl>  <dbl> <dbl> <dbl> <dbl> <dbl>
 1     0 dgetrf_nopiv      23     0     1     6      0   128 16000 16000 16000
 2     0 dgetrf_nopiv      23     0     1     6      0   256 16000 16000 16000
 3     0 dgetrf_nopiv      23     0     1     6      0   512 16000 16000 16000
 4     0 dgetrf_nopiv      23     0     1     6      0   320 16000 16000 16000
 5     0 dgetrf_nopiv      23     0     1     6      0  1600 16000 16000 16000
 6     0 dgetrf_nopiv      23     0     1     6      0   960 16000 16000 16000
 7     0 dgetrf_nopiv      23     0     1     6      0  1600 16000 16000 16000
 8     0 dgetrf_nopiv      23     0     1     6      0   512 16000 16000 16000
 9     0 dgetrf_nopiv      23     0     1     6      0   320 16000 16000 16000
10     0 dgetrf_nopiv      23     0     1     6      0   256 16000 16000 16000
# ℹ 100 more rows
# ℹ 5 more variables: seedA <dbl>, bump <dbl>, tsub <dbl>, time <dbl>,
#   gflops <dbl>
# ℹ Use `print(n = ...)` to see more rows
#+end_example

*** Read

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
options(crayon.enabled=FALSE)
library(tidyverse)
bind_rows(
  read_delim("data/times-SchedPQ.csv", show_col_types=FALSE, progress=FALSE, delim=";")
) |>
  mutate(KEY = paste0(P, "x", Q)) -> df
df
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 160 × 18
      Id Function     threads  gpus     P     Q mtxfmt    nb     m     n   lda
   <dbl> <chr>          <dbl> <dbl> <dbl> <dbl>  <dbl> <dbl> <dbl> <dbl> <dbl>
 1     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 2     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 3     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 4     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 5     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 6     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 7     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 8     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
 9     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
10     0 dgetrf_nopiv      23     0     1     6      0    64  8192  8192  8192
# ℹ 150 more rows
# ℹ 7 more variables: seedA <dbl>, bump <dbl>, tsub <dbl>, time <dbl>,
#   gflops <dbl>, scheduler <chr>, KEY <chr>
# ℹ Use `print(n = ...)` to see more rows
#+end_example

*** Read

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
options(crayon.enabled=FALSE)
library(starvz)
library(arrow)
library(tidyverse)
library(fs)
library(patchwork)
tibble(DIR = dir_ls("nmad")) |>
  separate(DIR, into=c("XX0", "KEY", "JOBID"), remove=FALSE) |>
  mutate(STARVZ = map(DIR, starvz_read)) |>
  mutate(STARVZ = map2(STARVZ, KEY, function(svz, key) {
    svz$Application |> mutate(KEY = key) -> svz$Application
    return(svz)
  })) |>
  mutate(STARVZ = map(STARVZ, function(svz) {
    svz$config$st$aggregation$step <- 100
#    svz$config$st$idleness <- TRUE
    svz$config$st$outliers <- FALSE
    svz$config$st$labels <- "NODES_only"
#    svz$config$st$aggregation$active <- TRUE
    svz$config$st$aggregation$method <- "nodes"
    return(svz) })) |>
  mutate(GC = map(STARVZ, panel_st)) |>
  mutate(GC = map(GC, function(p) { p + coord_cartesian(xlim=c(0, 48000)) } )) |>
  pull(GC) -> p
#wrap_plots(p, ncol=1)
p[[2]]
#p[[1]] + facet_wrap(~KEY)
#+end_src

#+RESULTS:
: Coordinate system already present. Adding new coordinate system, which will
: replace the existing one.
: Coordinate system already present. Adding new coordinate system, which will
: replace the existing one.
: Coordinate system already present. Adding new coordinate system, which will
: replace the existing one.
: Coordinate system already present. Adding new coordinate system, which will
: replace the existing one.

* Emacs setup                                                      :noexport:

#+BEGIN_SRC elisp
(setq org-export-global-macros
      '((section-name . "(eval (car (org-get-outline-path t)))")
        (subsection-name . "(eval (car (last (org-get-outline-path t))))")))
#+END_SRC

#+RESULTS:
: ((section-name . (eval (car (org-get-outline-path t)))) (subsection-name . (eval (car (last (org-get-outline-path t))))))


# Local Variables:
# eval: (add-to-list 'load-path ".")
# eval: (require 'ox-extra)
# eval: (require 'org-inlinetask)
# eval: (require 'org-ref)
# eval: (require 'doi-utils)
# eval: (ox-extras-activate '(ignore-headlines))
# eval: (setq ispell-local-dictionary "american")
# eval: (eval (flyspell-mode t))
# eval: (add-to-list 'org-latex-classes '("IEEEtran"
# "\\documentclass{IEEEtran}" ("\\section{%s}" . "\\section*{%s}")
# ("\\subsection{%s}" . "\\subsection*{%s}") ("\\subsubsection{%s}"
# . "\\subsubsection*{%s}") ("\\paragraph{%s}" . "\\paragraph*{%s}")  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
# End:


